run/annular_Couette_Cyclic/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;
R_in        0.065;
R_s         0.085;
R_out       0.090;
H           0.050;
N_1         25;
N_2         5;
N_H         50;
N_r         3;
theta       3.14159265359/24;

vertices
(
    ($R_in 0  0)                //0
    ($R_s 0 0)                  //1
    ($R_out 0 0)                //2

    (#calc "$R_out*cos($theta)"   #calc "$R_out*sin($theta)"     0)                //3
    (#calc "$R_s*cos($theta)"     #calc "$R_s*sin($theta)"       0)                //4
    (#calc "$R_in*cos($theta)"    #calc "$R_in*sin($theta)"       0)                //5

    ($R_in 0  $H)                //6
    ($R_s 0 $H)                  //7
    ($R_out 0 $H)                //8

    (#calc "$R_out*cos($theta)"   #calc "$R_out*sin($theta)"     $H)                //9
    (#calc "$R_s*cos($theta)"     #calc "$R_s*sin($theta)"       $H)                //10
    (#calc "$R_in*cos($theta)"   #calc  "$R_in*sin($theta)"       $H)               //11


    (0.707107 0.707107 1)   //8
    (1.414214 1.414214 1)   //9
);

blocks
(
    hex (0 1 4 5 6 7 10 11) ($N_1 $N_r $N_H) simpleGrading (1 1 1)
    hex (1 2 3 4 7 8 9 10)  ($N_2 $N_r $N_H) simpleGrading (1 1 1)



);

edges
(
    arc 0 5 (#calc "$R_in*cos($theta/2)"  #calc "$R_in*sin($theta/2)"  0)
    arc 1 4 (#calc "$R_s*cos($theta/2)"   #calc "$R_s*sin($theta/2)" 0)
    arc 2 3 (#calc "$R_out*cos($theta/2)" #calc "$R_out*sin($theta/2)" 0)

    arc 6 11 (#calc "$R_in*cos($theta/2)"  #calc "$R_in*sin($theta/2)"  $H)
    arc 7 10 (#calc "$R_s*cos($theta/2)" #calc "$R_s*sin($theta/2)" $H)
    arc 8 9  (#calc "$R_out*cos($theta/2)" #calc "$R_out*sin($theta/2)" $H)

);

boundary
(
    stator
    {
        type patch;
        faces
        (
            (0 1 4 5)
            (0 6 11 5)

        );
    }

    rotor
    {
        type patch;
        faces
        (
          (1 2 3 4)
          (2 3 9 8)

        );
    }

    top
    {
        type patch;
        faces
        (
            (6 7 10 11)
            (7 8 9 10)
        );
    }

    left
    {
        //type symmetry;
        type              cyclic;
        neighbourPatch    right;
        faces
        (
            (0 1 7 6)
            (1 2 8 7)

        );
    }

    right
    {
        //type symmetry;

        type              cyclic;
        neighbourPatch    left;

        faces
        (
            (4 5 11 10)
            (3 4 10 9)

        );
    }



);

mergePatchPairs
(
);

// ************************************************************************* //
