run/annular_Couette_Cyclic/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Jop;

JopCoeffs
{
    par_diameter         [0 1 0 0 0 0 0]  0.01;
    par_density          [0 0 0 0 0 0 0]  8.;
    par_friction         [0 0 0 0 0 0 0]   0.2;
    par_mu2              [0 0 0 0 0 0 0]   0.65;
    I0                   [0 0 0 0 0 0 0]   0.1;
    nu_max               [0 2 -1 0 0 0 0]  1.0;
    regularization       [0 0 -1 0 0 0 0]  0.0;
    K                    [0 0 0 0 0 0 0]  5000;


}

nu         [0 2 -1 0 0 0 0]  1e-2;
source      (0.0  0.0  -9.8);


// ************************************************************************* //
