run/annular_Couette_Cyclic/0/p
                                                             /*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    rotor
    {
        type            zeroGradient;

    }

    stator
    {
        type            zeroGradient;

    }


    top
    {
         type            fixedValue;
         value           uniform 0.0;
    }

     right
    {
        type                cyclic; //symmetry;
    }
    left
    {
        type                cyclic; //symmetry;
    }



}

// ************************************************************************* //
