run/annular_Couette_Cyclic/0/nu_fluid
                                                             /*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nu_fluid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{
       rotor
    {
        type            zeroGradient;
    }

    stator
    {
        type            zeroGradient;
    }


    top
    {
         type            fixedValue;
         value           uniform 1e-10;

    }

    right
    {
        type                cyclic; //symmetry;
    }
    left
    {
        type                cyclic; //symmetry;
    }
}

// ************************************************************************* //
